Инструменты/src/DataProcessors/УИ_КонсольЗапросов/УИ_КонсольЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УИ_КонсольЗапросов</name>
  <comment>Synoecium, ver 1.2.3</comment>
  <attributes>
    <name>ИспользоватьАвтосохранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалАвтосохранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТолькоВыделеннуюОбласть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБэкапЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоЗапросов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПути</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСжатиеФайлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонсоли</name>
  </attributes>
  <attributes>
    <name>РежимПодсветки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Инструменты/src/DataProcessors/УИ_КонсольЗапросов/Forms/ФормаНастройки/Module.bsl
&НаКлиенте
Процедура вУправлениеДиалогом()

	Элементы.ИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

//======================================= Обработка событий ==========================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Настройки=Параметры.Настройки;

	ФрмИспользоватьАвтосохранение          	= Настройки.ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения              	= Настройки.ИнтервалАвтосохранения;
	ФрмИспользоватьБэкапЗапросов           	= Настройки.ИспользоватьБэкапЗапросов;
    ФрмИспользоватьтолькоВыделеннуюОбласть 	= Настройки.ИспользоватьТолькоВыделеннуюОбласть;
	ФрмИспользоватьСжатиеФайлов 			= Настройки.ИспользоватьСжатиеФайлов;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	вУправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)
	
	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	вУправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Настройки=	Новый Структура;
	Настройки.Вставить("ИспользоватьАвтосохранение",ФрмИспользоватьАвтосохранение);
	Настройки.Вставить("ИнтервалАвтосохранения",ФрмИнтервалАвтосохранения);
	Настройки.Вставить("ИспользоватьБэкапЗапросов",ФрмИспользоватьБэкапЗапросов);
	Настройки.Вставить("ИспользоватьТолькоВыделеннуюОбласть",ФрмИспользоватьтолькоВыделеннуюОбласть);
	Настройки.Вставить("ИспользоватьСжатиеФайлов",ФрмИспользоватьСжатиеФайлов);
	
		
	Закрыть(Настройки);

КонецПроцедуры
